# Copyright (C) 2026 KevinCrrl and Evillimiter-NG Contributors
# SPDX-License-Identifier: GPL-2.0-only

from evillimiter_ng.common import globals as bg
from .io import IO

MAIN_BANNER = f"""{IO.BOLD_LIGHTRED}
 ███████╗██╗   ██╗██╗██╗      ██╗      ██╗███╗   ███╗██╗████████╗███████╗██████╗         ███╗   ██╗ ██████╗
 ██╔════╝██║   ██║██║██║      ██║      ██║████╗ ████║██║╚══██╔══╝██╔════╝██╔══██╗        ████╗  ██║██╔════╝
 █████╗  ██║   ██║██║██║      ██║      ██║██╔████╔██║██║   ██║   █████╗  ██████╔╝        ██╔██╗ ██║██║  ███╗
 ██╔══╝  ╚██╗ ██╔╝██║██║      ██║      ██║██║╚██╔╝██║██║   ██║   ██╔══╝  ██╔══██╗  ████  ██║╚██╗██║██║   ██║
 ███████╗ ╚████╔╝ ██║███████╗ ███████╗ ██║██║ ╚═╝ ██║██║   ██║   ███████╗██║  ██║        ██║ ╚████║╚██████╔╝
 ╚══════╝  ╚═══╝  ╚═╝╚══════╝ ╚══════╝ ╚═╝╚═╝     ╚═╝╚═╝   ╚═╝   ╚══════╝╚═╝  ╚═╝        ╚═╝  ╚═══╝ ╚═════╝
                {IO.END_BOLD_LIGHTRED}by bitbrute  ~  limit devices on your network :3
                KevinCrrl    ~  Next Generation
                                    v{bg.VERSION}

"""  # noqa
